{
    "Full Moon": "A Full Moon occurs when the Sun, Earth, and Moon are aligned, with the Earth positioned between the Sun and the Moon. This allows the entire face of the Moon to be illuminated, making it appear as a bright, glowing sphere in the night sky. Full Moons are often associated with folklore, tides, and various cultural celebrations, and they occur approximately once every 29.5 days as part of the lunar cycle.",
    "New Moon": "A New Moon occurs when the Moon is positioned between the Earth and the Sun, making its illuminated side face away from us. As a result, the Moon becomes nearly invisible in the night sky. This phase marks the beginning of the lunar cycle, occurring approximately every 29.5 days. It also provides the darkest skies, making it an ideal time for stargazing.",
    "Spring Equinox": "The Spring Equinox, also known as the Vernal Equinox, marks the moment when day and night are nearly equal in length, signaling the transition from winter to spring. Occurring around March 20th or 21st in the Northern Hemisphere and September 22nd or 23rd in the Southern Hemisphere, this astronomical event happens when the Sun crosses the celestial equator, bringing increased daylight and warmer temperatures.",
    "Total Lunar Eclipse": "A Total Lunar Eclipse takes place when the Earth comes directly between the Sun and the Moon, casting a shadow that completely covers the Moon. As sunlight filters through the Earth’s atmosphere, it gives the Moon a reddish hue, often referred to as a Blood Moon. This stunning event can last for several hours and is visible from anywhere on Earth where the Moon is above the horizon. Unlike solar eclipses, lunar eclipses are safe to view with the naked eye.",
    "Partial Solar Eclipse": "A Partial Solar Eclipse happens when the Moon partially covers the Sun, creating a crescent-shaped Sun in the sky. Unlike a total solar eclipse, the Sun is never completely obscured, and a portion remains visible. This occurs when the Moon, Sun, and Earth are not perfectly aligned. Observers need special eye protection to view it safely, as looking directly at the Sun can cause serious eye damage."
}